nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/driver_examples/jpegdec/single_stream_single_frame/config/cm33_core0/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI        0x00u /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FUNC0            0x00u /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI         0x00u /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI           0x00u /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI      0x00u /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN      0x00u /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI          0x00u /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define IOPCTL_PIO_FULLDRIVE_DI     0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMipiPanelPinsEvk(void);    /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI        0x00u /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FUNC1            0x01u /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI         0x00u /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI           0x00u /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI      0x00u /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN      0x00u /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI          0x00u /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Analog mux is disabled */
#define IOPCTL_PIO_ANAMUX_DI 0x00u
/*!
 * @brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC0 0x00u
/*!
 * @brief Selects pin function 5 */
#define IOPCTL_PIO_FUNC5 0x05u
/*!
 * @brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_DI 0x00u
/*!
 * @brief Input function is not inverted */
#define IOPCTL_PIO_INV_DI 0x00u
/*!
 * @brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u
/*!
 * @brief Enable pull-down function */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u
/*!
 * @brief Enable pull-up function */
#define IOPCTL_PIO_PULLUP_EN 0x20u
/*!
 * @brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u
/*!
 * @brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u
/*!
 * @brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u
/*!
 * @brief Slow mode */
#define IOPCTL_PIO_SLEW_RATE_SLOW 0x80u
/*!
 * @brief Port Data Direction: Pin is configured as general-purpose output for the GPIO function. */
#define PDDR_PDD0_pdd1 0x01u
/*!
 * @brief Port Data Direction: Pin is configured as general-purpose output for the GPIO function. */
#define PDDR_PDD15_pdd1 0x01u
/*!
 * @brief Port Data Direction: Pin is configured as general-purpose output for the GPIO function. */
#define PDDR_PDD1_pdd1 0x01u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexIOPanelPins(void);     /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI        0x00u /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FUNC0            0x00u /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC7            0x07u /*!<@brief Selects pin function 7 */
#define IOPCTL_PIO_INBUF_DI         0x00u /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI           0x00u /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI      0x00u /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN      0x00u /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI          0x00u /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLcdDBIPanelPins(void);  /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_INBUF_EN    0x40u   /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_PUPD_EN     0x10u   /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_PULLUP_EN   0x20u   /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u /*!<@brief Pseudo Output Drain is enabled */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2cPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

void BOARD_InitPsRamPins_Xspi2(void);

#define IOPCTL_PIO_DRIVE_100OHM     0x00u       /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_ANAMUX_DI        0x00u       /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI     0x00u       /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0            0x00u       /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1            0x01u       /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC5            0x05u       /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI         0x00u       /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN         0x40u       /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI           0x00u       /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI      0x00u       /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN      0x0400u     /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN      0x00u       /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI          0x00u       /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u       /*!<@brief Normal mode */
#define IOPCTL_PIO_PUPD_EN          0x10u       /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_PULLUP_EN        0x20u       /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_DRIVE_33OHM      (0x3 << 12) /*!< Selects transmitter current drive 33ohm */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDCardPins(void); /* Function assigned for the Cortex-M33 (Core #0) */
#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
